app/controllers/posts_controller.rb

  def create
    PostCreator.new.create(post_params, current_user)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "cat_photo") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Elsie Maria!"], ["user_id", 1], ["created_at", 2016-05-08 21:31:51 UTC], ["updated_at", 2016-05-08 21:31:51 UTC], ["cat_photo", "10534537_916275485066752_4658578166440761121_n.jpg"]]